# Taps
tap "artginzburg/tap"
tap "daipeihust/tap"

brew "zsh"

# Development
brew "mise"

# Utilities
brew "artginzburg/tap/sudo-touchid"  # Touch ID for sudo
brew "daipeihust/tap/im-select"      # Input method switcher (for Vim)
brew "mole"                          # Mac cleanup / optimization
brew "tmux"                          # Terminal multiplexer

# Apps
cask "claude"
cask "claude-code@latest"
cask "codex-app"
cask "codexbar"
cask "discord"
cask "figma@beta"
cask "ghostty"
cask "google-chrome"
cask "notion"
cask "orbstack"
# cask "raycast"          # Trying Raycast 2.0 instead — https://www.raycast.com/new
cask "spotify"
cask "vibe-island"

# Utilities (Apps)
cask "aldente"            # Battery charge limiter
cask "chatwise"           # Chat client
cask "cleanshot"          # Screenshot tool
cask "input-source-pro"   # Input source manager
cask "monitorcontrol"     # External monitor brightness
cask "notion-mail"
cask "repobar"            # GitHub repo menu-bar dashboard
cask "scroll-reverser"    # Mouse scroll direction

# Fonts
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
