# Taps
tap "daipeihust/tap"
tap "vorssaint/tap"
tap "yusukebe/tap"

brew "zsh"

# Development
brew "mise"
brew "agent-browser"  # Browser automation CLI for AI agents
brew "yusukebe/tap/ax"  # HTML fetch / extract CLI

# Utilities
brew "daipeihust/tap/im-select"      # Input method switcher (for Vim)
brew "mole"                          # Mac cleanup / optimization

# Apps
cask "claude-code@latest"
cask "codex"       # CLI
cask "codex-app"   # Desktop app
cask "codexbar"
cask "cursor"      # AI code editor
cask "discord"
cask "ghostty"
cask "grok-build"  # Grok Build CLI
cask "notion"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "thebrowsercompany-dia"     # Dia browser
cask "vibe-island"

# Utilities (Apps)
cask "aldente"            # Battery charge limiter
cask "cleanshot"          # Screenshot tool
cask "input-source-pro"   # Input source manager
cask "monitorcontrol"     # External monitor brightness
cask "vorssaint/tap/vorssaint"  # Menu bar toolkit (scroll direction, volume mixer, …)

# Fonts
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
