# Taps
tap "artginzburg/tap"
tap "daipeihust/tap"

# Shell
brew "zsh"
brew "starship"           # Prompt
brew "fzf"                # Fuzzy finder
brew "fd"                 # Fast file search (fzf backend)
brew "bat"                # File preview with syntax highlighting (fzf backend)
brew "eza"                # Modern ls replacement
brew "ripgrep"            # Fast grep

# Development
brew "gh"                 # GitHub CLI
brew "ni"                 # Node package manager selector
brew "pnpm"               # Fast Node package manager
brew "rbenv"              # Ruby version manager
brew "imagemagick"        # Image processing

# Utilities
brew "htop"               # Process monitor
brew "terminal-notifier"  # macOS notifications from terminal
brew "sudo-touchid"       # Touch ID for sudo
brew "im-select"          # Input method switcher (for Vim)
brew "agent-browser"      # Browser automation for AI agents

# Apps
cask "arc"
cask "claude"
cask "claude-code@latest"
cask "codex-app"
cask "codexbar"
cask "discord"
cask "figma@beta"
cask "ghostty"
cask "google-chrome"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "yaak@beta"

# Utilities (Apps)
cask "aldente"            # Battery charge limiter
cask "chatwise"           # Chat client
cask "input-source-pro"   # Input source manager
cask "monitorcontrol"     # External monitor brightness
cask "notion-mail"
cask "rectangle"          # Window manager
cask "scroll-reverser"    # Mouse scroll direction
cask "surfshark"          # VPN

# Fonts
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
